[
  {
    "datetime": "2024-06-07T15:05:14.000Z",
    "source": "aoc",
    "text": "The cynics will tell you that one vote won’t change anything.\n\nBut what they don’t tell you is that nothing can change without a vote.\n\nThe truth is, the world doesn’t belong to the cynics. It’s up to us.\n\nNew York: It’s time to vote.\nTuesday, June 25th.\n\nSpread the word.",
    "subtext": null,
    "has_video": true,
    "image_count": 0,
    "pca1": -0.6536093950271606,
    "pca2": 0.446213036775589
  },
  {
    "datetime": "2025-12-19T21:18:17.000Z",
    "source": "aoc",
    "text": "Now the coverup is out in the open. This is far from over.\n\nEveryone involved will have to answer for this. Pam Bondi, Kash Patel, whole admin.\n\nProtecting a bunch of rapists and pedophiles because they have money, power, and connections.\n\nBondi should resign tonight.",
    "subtext": "Epstein Files: 119-page grand jury document entirely redacted — MSNow",
    "has_video": false,
    "image_count": 0,
    "pca1": -0.507377564907074,
    "pca2": -0.31312742829322815
  },
  {
    "datetime": "2025-12-17T23:56:52.000Z",
    "source": "aoc",
    "text": "Like I said: view all political developments for the rest of the week in light of the fact that the Epstein Files are supposed to be released on Friday.\n\nHouse Republicans just suddenly cancelled Congressional session Friday and are sending everyone home Thursday evening.",
    "subtext": "NEW: Congress is giving itself an early holiday break.\n\nHouse GOP leadership is cancelling Friday votes, letting members skip town tomorrow afternoon instead.",
    "has_video": false,
    "image_count": 1,
    "pca1": 0.4777812659740448,
    "pca2": -0.27144619822502136
  },
  {
    "datetime": "2025-12-17T22:02:33.000Z",
    "source": "aoc",
    "text": "Reminder that the Epstein Files are supposed to be released on Friday and every political development that you see between now until then should be viewed with that in mind.",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "pca1": -0.5074121356010437,
    "pca2": -0.35488346219062805
  },
  {
    "datetime": "2025-12-17T16:57:28.000Z",
    "source": "aoc",
    "text": "“I have not lost control of the House” sounds like a guy who has definitely lost control of the House",
    "subtext": "Asked Speaker Johnson if he’s lost control of the House after another discharge petition succeeds — this one on health care at the hands of swing-district Republicans.\n\n“I have not lost control of the House,” he told me",
    "has_video": true,
    "image_count": 0,
    "pca1": -0.6641460657119751,
    "pca2": 0.4497327506542206
  },
  {
    "datetime": "2025-12-17T12:59:56.000Z",
    "source": "aoc",
    "text": "Bloop!",
    "subtext": "Alexandria Ocasio-Cortez leads JD Vance 51%-49% in hypothetical 2028 poll — Verasight",
    "has_video": false,
    "image_count": 1,
    "pca1": 0.4821102023124695,
    "pca2": -0.2117917388677597
  },
  {
    "datetime": "2025-12-12T05:49:42.000Z",
    "source": "aoc",
    "text": "Good!",
    "subtext": "JUST IN Chandler City Council votes 5-0 to reject Sinema-backed AI data center. \"It doesn't fit\" in Chandler, mayor says after 2 hours of public comment. x.com/brahmresnik/st…",
    "has_video": false,
    "image_count": 0,
    "pca1": -0.5143811106681824,
    "pca2": -0.31801509857177734
  },
  {
    "datetime": "2025-11-21T16:15:38.000Z",
    "source": "aoc",
    "text": "Guess this didn’t work out the way you thought it would. ",
    "subtext": "Here’s the new face of the Democrat party — a literal communist — on his way to the White House to be schooled by President Trump. x.com/FoxNews/status…",
    "has_video": false,
    "image_count": 0,
    "pca1": -0.5136880278587341,
    "pca2": -0.30831703543663025
  },
  {
    "datetime": "2025-11-17T21:08:27.000Z",
    "source": "aoc",
    "text": "This is how I feel about it.\n\nI loathe machine politics and got to office defeating an incumbent who got in that way.\n\nHowever there are quite a few problems with choosing to grind the entire House to a halt to force all 435 members across the country to do a rushed vote on this one individual instance (of many, mind you!).\n\n1. Why is it that this objection wasn’t brought up until now? The author had no problem when Bill Posey did it, or even earlier this year when a member’s account was tweeting post mortem for an election. The standard of this resolution is unevenly applied and choosing to enforce it via privileged resolution for some but not others does open legitimate questions of rationale or motivation. Why not care about this for them, but care about it now? This question has not been answered.\n\n2. This is why the Ethics Committee exists. Establishing this process as precedent will mean all 435 members of the House will be forced to vote on a slew of individual member indiscretions determined by political convenience of whoever is in the majority. I do not think it is the best use of my constituents’ time to sort through the details of every individual matter of a person acting out of accordance with the esteem of the office once a week for a floor vote under rushed circumstances. The House has an investigatory structure for this for a reason. If there was a complaint filed with Ethics or an investigation buried and then ignored, I’d understand. But that’s not the case here.\n\n3. These specific kinds of resolutions can ONLY be executed on a partisan basis because the mechanism of seeking privilege on this can only move forward with GOP leadership’s blessing. That means partisan enforcement and I do not want to open the door to that. Make it nonpartisan or don’t bother - that’s why the Ethics Committee is structured the way it is.\n\n4. This resolution was dropped on a fly out day to begin voting on a fly in day, giving people no time to review the details of the matter while they are home in district on a weekend. On a matter of local politics that nobody had familiarity with. People are genuinely not familiar with the details of this surprise vote because this is the kind of thing brought to Ethics precisely to investigate and confirm details.",
    "subtext": "\"Pointing it out\" is fine, that's why the good Lord in her infinite wisdom invented Twitter. What I'd ask Members of Congress contemplating this course of action is- does your colleague's behavior rise to the level that you must personally force the whole House to vote on it? x.com/jonfavs/status…",
    "has_video": false,
    "image_count": 0,
    "pca1": -0.5215530395507812,
    "pca2": -0.36894091963768005
  },
  {
    "datetime": "2025-11-10T01:53:07.000Z",
    "source": "aoc",
    "text": "The average monthly SNAP benefit is $177 a person.\n\nThe average ACA benefit is up to $550 a person/mo.\n\nPeople want us to hold the line for a reason. This is not a matter of appealing to a base. It’s about people’s lives.\n\nWorking people want leaders whose word means something.",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "pca1": -0.5135433077812195,
    "pca2": -0.31144189834594727
  },
  {
    "datetime": "2025-11-06T00:45:34.000Z",
    "source": "aoc",
    "text": "It was an honor to break bread with our Mayor-elect \n@ZohranKMamdani\n over some of the best momos Jackson Heights has to offer.  \n\nFrom childcare to rent, New York should be affordable and safe for working families. Let’s get to work! ",
    "subtext": "A busy first day as your Mayor-elect: early morning interviews, transition announcements and meetings. More to say on all of it tomorrow. \n\nBut a highlight was lunch with my Congresswoman @AOC at Laliguras Bistro in Jackson Heights.",
    "has_video": false,
    "image_count": 3,
    "pca1": 2.507158041000366,
    "pca2": -0.014538737945258617
  },
  {
    "datetime": "2025-12-25T02:12:53.000Z",
    "source": "trump",
    "text": "Merry Christmas to all, including the Radical Left Scum that is doing everything possible to destroy our Country, but are failing badly. We no longer have Open Borders, Men in Women’s Sports, Transgender for Everyone, or Weak Law Enforcement. What we do have is a Record Stock Market and 401K’s, Lowest Crime numbers in decades, No Inflation, and yesterday, a 4.3 GDP, two points better than expected. Tariffs have given us Trillions of Dollars in Growth and Prosperity, and the strongest National Security we have ever had. We are respected again, perhaps like never before. God Bless America!!! President DJT",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "pca1": -0.5107473134994507,
    "pca2": -0.36606913805007935
  },
  {
    "datetime": "2025-12-23T20:35:55.000Z",
    "source": "trump",
    "text": "THE TRUMP KENNEDY CENTER HONORS will be broadcast tonight, on CBS, and Stream on Paramount+. Tune in at 8 P.M. EST! At the request of the Board, and just about everybody else in America, I am hosting the event. Tell me what you think of my “Master of Ceremony” abilities. If really good, would you like me to leave the Presidency in order to make “hosting” a full time job? We will be honoring true GREATS in the History of Entertainment: Sylvester Stallone, Michael Crawford, KISS, George Strait, and Gloria Gaynor.",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "pca1": -0.4949454069137573,
    "pca2": -0.32292935252189636
  },
  {
    "datetime": "2025-12-02T16:52:21.000Z",
    "source": "trump",
    "text": "I am asking all America First Patriots in Tennessee’s 7th Congressional District to please GET OUT AND VOTE for a phenomenal Candidate and MAGA Warrior, Matt Van Epps! You can win this Election for Matt, who has my Complete and Total Endorsement. HE WILL BE A GREAT CONGRESSMAN and, unlike his Opponent, he cherishes Christianity and Country Music — She has openly stated that she hates them both!\n \nTN-07: Polls close at 7:00 P.M. IF YOU ARE IN LINE BY 7 P.M., STAY IN LINE, AND THEY MUST LET YOU VOTE. GET OUT AND VOTE, VOTE, VOTE FOR MATT VAN EPPS — HE WILL NEVER LET YOU DOWN!\n \nFind your voting location and hours at:",
    "subtext": null,
    "has_video": false,
    "image_count": 1,
    "pca1": 0.5217854380607605,
    "pca2": -0.29273247718811035
  },
  {
    "datetime": "2025-12-02T02:10:14.000Z",
    "source": "trump",
    "text": "I am asking all America First Patriots in Tennessee’s 7th Congressional District to please GET OUT AND VOTE TOMORROW for a phenomenal Candidate, Matt Van Epps, on Election Day, Tuesday, December 2nd! You can win this Election for MAGA Warrior Matt Van Epps, who has my Complete and Total Endorsement. HE WILL BE A GREAT CONGRESSMAN and, unlike his Opponent, he cherishes Christianity and Country Music — She has openly stated that she hates them both!\n \nTN-07: Polls open in all Counties no later than 9:00 A.M., but some open as early as 7:00 A.M. Polls close at 7:00 P.M. IF YOU ARE IN LINE BY 7 P.M., STAY IN LINE, AND THEY MUST LET YOU VOTE! Election Day is TOMORROW, December 2nd. GET OUT AND VOTE, VOTE, VOTE FOR MATT VAN EPPS — HE WILL NEVER LET YOU DOWN!\n \nFind your voting location and hours at:",
    "subtext": null,
    "has_video": false,
    "image_count": 1,
    "pca1": 0.522693395614624,
    "pca2": -0.31219226121902466
  },
  {
    "datetime": "2025-11-29T13:27:23.000Z",
    "source": "trump",
    "text": "To all Airlines, Pilots, Drug Dealers, and Human Traffickers, please consider THE AIRSPACE ABOVE AND SURROUNDING VENEZUELA TO BE CLOSED IN ITS ENTIRETY. Thank you for your attention to this matter! PRESIDENT DONALD J. TRUMP",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "pca1": -0.52304607629776,
    "pca2": -0.3891294598579407
  },
  {
    "datetime": "2025-11-28T16:10:22.000Z",
    "source": "trump",
    "text": "The United States did not attend the G20 in South Africa, because the South African Government refuses to acknowledge or address the horrific Human Right Abuses endured by Afrikaners, and other descendants of Dutch, French, and German settlers. To put it more bluntly, they are killing white people, and randomly allowing their farms to be taken from them. Perhaps, worst of all, the soon to be out of business New York Times and the Fake News Media won’t issue a word against this genocide. That’s why all the Liars and Pretenders of the Radical Left Media are going out of business! At the conclusion of the G20, South Africa refused to hand off the G20 Presidency to a Senior Representative from our U.S. Embassy, who attended the Closing Ceremony. Therefore, at my direction, South Africa will NOT be receiving an invitation to the 2026 G20, which will be hosted in the Great City of Miami, Florida next year. South Africa has demonstrated to the World they are not a country worthy of Membership anywhere, and we are going to stop all payments and subsidies to them, effective immediately. Thank you for your attention to this matter!",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "pca1": -0.5206827521324158,
    "pca2": -0.4022829234600067
  },
  {
    "datetime": "2025-11-28T16:08:50.000Z",
    "source": "trump",
    "text": "Democracy is on trial in the coming Elections in the beautiful country of Honduras on November 30th. Will Maduro and his Narcoterrorists take over another country like they have taken over Cuba, Nicaragua, and Venezuela? The man who is standing up for Democracy, and fighting against Maduro, is Tito Asfura, the Presidential Candidate of the National Party. Tito was the highly successful Mayor of Tegucigalpa where he brought running water to millions, and paved hundreds of kilometers of roads. His chief opponent is Rixi Moncada, who says Fidel Castro is her idol. Normally, the smart people of Honduras, would reject her, and elect Tito Asfura, but the Communists are trying to trick the people by running a third Candidate, Salvador Nasralla. Nasralla is no friend of Freedom. A borderline Communist, he helped Xiomara Castro by running as her Vice President. He won, and helped Castro win. Then he resigned, and is now pretending to be an anti-Communist only for the purposes of splitting Asfura’s vote. The people of Honduras must not be tricked again. The only real friend of Freedom in Honduras is Tito Asfura. Tito and I can work together to fight the Narcocommunists, and bring needed aid to the people of Honduras. I cannot work with Moncada and the Communists, and Nasralla is not a reliable partner for Freedom, and cannot be trusted. I hope the people of Honduras vote for Freedom and Democracy, and elect Tito Asfura, President!",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "pca1": -0.5100587606430054,
    "pca2": -0.4375264346599579
  },
  {
    "datetime": "2025-11-28T05:10:34.000Z",
    "source": "trump",
    "text": "A very Happy Thanksgiving salutation to all of our Great American Citizens and Patriots who have been so nice in allowing our Country to be divided, disrupted, carved up, murdered, beaten, mugged, and laughed at, along with certain other foolish countries throughout the World, for being “Politically Correct,” and just plain STUPID, when it comes to Immigration. The official United States Foreign population stands at 53 million people (Census), most of which are on welfare, from failed nations, or from prisons, mental institutions, gangs, or drug cartels. They and their children are supported through massive payments from Patriotic American Citizens who, because of their beautiful hearts, do not want to openly complain or cause trouble in any way, shape, or form. They put up with what has happened to our Country, but it’s eating them alive to do so! A migrant earning $30,000 with a green card will get roughly $50,000 in yearly benefits for their family. The real migrant population is much higher. This refugee burden is the leading cause of social dysfunction in America, something that did not exist after World War II (Failed schools, high crime, urban decay, overcrowded hospitals, housing shortages, and large deficits, etc.). As an example, hundreds of thousands of refugees from Somalia are completely taking over the once great State of Minnesota. Somalian gangs are roving the streets looking for “prey” as our wonderful people stay locked in their apartments and houses hoping against hope that they will be left alone. The seriously retarded Governor of Minnesota, Tim Walz, does nothing, either through fear, incompetence, or both, while the worst “Congressman/woman” in our Country, Ilhan Omar, always wrapped in her swaddling hijab, and who probably came into the U.S.A. illegally in that you are not allowed to marry your brother, does nothing but hatefully complain about our Country, its Constitution, and how “badly” she is treated, when her place of origin is a decadent, backward, and crime ridden nation, which is essentially not even a country for lack of Government, Military, Police, schools, etc. Even as we have progressed technologically, Immigration Policy has eroded those gains and living conditions for many. I will permanently pause migration from all Third World Countries to allow the U.S. system to fully recover, terminate all of the millions of Biden illegal admissions, including those signed by Sleepy Joe Biden’s Autopen, and remove anyone who is not a net asset to the United States, or is incapable of loving our Country, end all Federal benefits and subsidies to noncitizens of our Country, denaturalize migrants who undermine domestic tranquility, and deport any Foreign National who is a public charge, security risk, or non-compatible with Western Civilization. These goals will be pursued with the aim of achieving a major reduction in illegal and disruptive populations, including those admitted through an unauthorized and illegal Autopen approval process. Only REVERSE MIGRATION can fully cure this situation. Other than that, HAPPY THANKSGIVING TO ALL, except those that hate, steal, murder, and destroy everything that America stands for — You won’t be here for long!",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "pca1": -0.5117987394332886,
    "pca2": -0.42634350061416626
  },
  {
    "datetime": "2025-11-26T21:59:16.000Z",
    "source": "trump",
    "text": null,
    "subtext": null,
    "has_video": false,
    "image_count": 1,
    "pca1": 0.475529283285141,
    "pca2": 0.48729148507118225
  },
  {
    "datetime": "2025-11-25T23:57:56.000Z",
    "source": "trump",
    "text": "I am asking all America First Patriots in Tennessee’s 7th Congressional District, who haven’t voted yet, to please GET OUT AND VOTE for MAGA Warrior Matt Van Epps, tomorrow, November 26th, the last day to vote early in person. You can win this Election for Matt! PLEASE VOTE FOR MATT VAN EPPS, who has my Complete and Total Endorsement. Polls close at 12 P.M. NOON in most of TN-07, and every vote counts. IF YOU ARE IN LINE BY 12 P.M., STAY IN LINE, AND THEY MUST LET YOU VOTE! TN-07: Early Voting ends November 26th, and Election Day is December 2nd. GET OUT AND VOTE FOR MATT VAN EPPS — HE WILL NEVER LET YOU DOWN!\n \nFind your Early Voting location at:",
    "subtext": null,
    "has_video": false,
    "image_count": 1,
    "pca1": 0.5208706259727478,
    "pca2": -0.3012017011642456
  },
  {
    "datetime": "2025-10-14T17:20:04.000Z",
    "source": "trump",
    "text": "Don’t forget to get a copy of my son Eric’s book, “UNDER SIEGE,” which is breaking records everywhere. It’s a phenomenal book, that’s a must read for everyone—Congratulations Eric, you deserve it!!! \na.co/d/7oPyLF5",
    "subtext": null,
    "has_video": false,
    "image_count": 1,
    "pca1": 0.5130341649055481,
    "pca2": -0.17895464599132538
  },
  {
    "datetime": "2025-10-14T02:46:13.000Z",
    "source": "trump",
    "text": null,
    "subtext": null,
    "has_video": true,
    "image_count": 0,
    "pca1": -0.6404596567153931,
    "pca2": 1.05913245677948
  },
  {
    "datetime": "2025-10-12T04:43:54.000Z",
    "source": "trump",
    "text": "I am pleased to announce that the great Dan Scavino, in addition to remaining Deputy Chief of Staff of the Trump Administration, will head the White House Presidential Personnel Office, replacing Sergio Gor, who did a wonderful job in that position, and will now become the Ambassador to India. Dan will be responsible for the selection and appointment of almost all positions in government, a very big and important position. Congratulations Dan, you will do a fantastic job!!! President DJT",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "pca1": -0.4941891133785248,
    "pca2": -0.34140509366989136
  },
  {
    "datetime": "2025-10-03T03:33:23.000Z",
    "source": "trump",
    "text": null,
    "subtext": null,
    "has_video": true,
    "image_count": 0,
    "pca1": -0.6404596567153931,
    "pca2": 1.05913245677948
  },
  {
    "datetime": "2025-10-03T03:30:37.000Z",
    "source": "trump",
    "text": null,
    "subtext": null,
    "has_video": true,
    "image_count": 0,
    "pca1": -0.640471875667572,
    "pca2": 1.059118390083313
  },
  {
    "datetime": "2025-10-01T03:02:36.000Z",
    "source": "trump",
    "text": "It was great being with King Charles, Queen Camilla, and the Royal Family!",
    "subtext": null,
    "has_video": false,
    "image_count": 4,
    "pca1": 3.5316274166107178,
    "pca2": 0.1973796933889389
  },
  {
    "datetime": "2025-10-01T03:01:51.000Z",
    "source": "trump",
    "text": "Yes, I’m watching. Congratulations!",
    "subtext": null,
    "has_video": true,
    "image_count": 0,
    "pca1": -0.6210794448852539,
    "pca2": 0.5106861591339111
  },
  {
    "datetime": "2025-10-01T03:00:58.000Z",
    "source": "trump",
    "text": null,
    "subtext": null,
    "has_video": false,
    "image_count": 1,
    "pca1": 0.475529283285141,
    "pca2": 0.48729148507118225
  },
  {
    "datetime": "2025-10-01T02:49:30.000Z",
    "source": "trump",
    "text": null,
    "subtext": null,
    "has_video": false,
    "image_count": 1,
    "pca1": 0.475529283285141,
    "pca2": 0.48729148507118225
  }
]